#### Terraform Plan ✅
```
module.talos.talos_image_factory_schematic.this: Refreshing state... [id=d4cf8602b9d285ede53209d5e8c482372d61d3b9aa850736c2dc65bd8d091cba]
module.talos.talos_machine_secrets.machine_secrets: Refreshing state... [id=machine_secrets]
module.talos.data.talos_image_factory_urls.this: Reading...
module.talos.data.talos_image_factory_urls.this: Read complete after 1s
module.proxmox.proxmox_virtual_environment_download_file.talos_nocloud_image["pve01"]: Refreshing state... [id=local:iso/talos-v1.11.5-nocloud-amd64.img]
module.talos.data.talos_client_configuration.talosconfig: Reading...
module.talos.data.talos_machine_configuration.machineconfig_worker: Reading...
module.talos.data.talos_machine_configuration.machineconfig_cp: Reading...
module.talos.data.talos_client_configuration.talosconfig: Read complete after 0s [id=cluster01]
module.talos.data.talos_machine_configuration.machineconfig_worker: Read complete after 0s [id=cluster01]
module.talos.data.talos_machine_configuration.machineconfig_cp: Read complete after 0s [id=cluster01]
module.proxmox.proxmox_virtual_environment_vm.talos_cp["talos-cp-01"]: Refreshing state... [id=101]
module.proxmox.proxmox_virtual_environment_vm.talos_workers["talos-worker-01"]: Refreshing state... [id=102]
module.talos.talos_machine_configuration_apply.worker_config_apply["talos-worker-01"]: Refreshing state... [id=machine_configuration_apply]
module.talos.talos_machine_configuration_apply.cp_config_apply["talos-cp-01"]: Refreshing state... [id=machine_configuration_apply]
module.talos.talos_machine_bootstrap.bootstrap: Refreshing state... [id=machine_bootstrap]
module.talos.talos_cluster_kubeconfig.kubeconfig: Refreshing state... [id=cluster01]
module.proxmox_csi_plugin.proxmox_virtual_environment_role.csi: Refreshing state... [id=CSI]
module.traefik.tls_private_key.ubuntu_container_key: Refreshing state... [id=0940bdcfb1f2130a3129ccae2ec89db43fb78626]
module.traefik.proxmox_virtual_environment_download_file.latest_ubuntu_20_focal_lxc_img: Refreshing state... [id=local:vztmpl/ubuntu-20.04-standard_20.04-1_amd64.tar.gz]
module.traefik.random_password.ubuntu_container_password: Refreshing state... [id=none]
module.proxmox_csi_plugin.helm_release.proxmox_csi_plugin: Refreshing state... [id=proxmox-csi-plugin]
module.sealed-secrets.helm_release.sealed_secrets: Refreshing state... [id=sealed-secrets-controller]
module.proxmox_csi_plugin.proxmox_virtual_environment_user.kubernetes-csi: Refreshing state... [id=kubernetes-csi@pve]
module.sealed-secrets.kubernetes_secret.sealed-secrets-key: Refreshing state... [id=sealed-secrets/sealed-secrets-bootstrap-key]
module.proxmox_csi_plugin.proxmox_virtual_environment_user_token.kubernetes-csi-token: Refreshing state... [id=kubernetes-csi@pve!csi]
module.traefik.proxmox_virtual_environment_container.traefik: Refreshing state... [id=108]
module.traefik.null_resource.traefik_config_sync: Refreshing state... [id=5599146275299180159]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.monitoring.kubernetes_namespace_v1.monitoring will be created
  + resource "kubernetes_namespace_v1" "monitoring" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "pod-security.kubernetes.io/enforce" = "privileged"
            }
          + name             = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.proxmox_csi_plugin.helm_release.proxmox_csi_plugin will be created
  + resource "helm_release" "proxmox_csi_plugin" {
      + atomic                     = false
      + chart                      = "proxmox-csi-plugin"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "proxmox-csi-plugin"
      + namespace                  = "csi-proxmox"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://ghcr.io/sergelogvinov/charts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                storageClass:
                  - name: proxmox-csi
                    cache: writethrough
                    fstype: ext4
                    reclaimPolicy: Retain
                    ssd: false
                    storage: raid1
                    mountOptions:
                      - noatime
            EOT,
        ]
      + verify                     = false
      + version                    = "0.5.5"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.proxmox_csi_plugin.kubernetes_namespace_v1.csi-proxmox will be created
  + resource "kubernetes_namespace_v1" "csi-proxmox" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "pod-security.kubernetes.io/audit"   = "baseline"
              + "pod-security.kubernetes.io/enforce" = "privileged"
              + "pod-security.kubernetes.io/warn"    = "baseline"
            }
          + name             = "csi-proxmox"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.proxmox_csi_plugin.kubernetes_secret.proxmox-csi-plugin will be created
  + resource "kubernetes_secret" "proxmox-csi-plugin" {
      + binary_data_wo                 = (write-only attribute)
      + data                           = (sensitive value)
      + data_wo                        = (write-only attribute)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "proxmox-csi-plugin"
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.sealed-secrets.helm_release.sealed_secrets will be created
  + resource "helm_release" "sealed_secrets" {
      + atomic                     = false
      + chart                      = "sealed-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "sealed-secrets-controller"
      + namespace                  = "sealed-secrets"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://registry-1.docker.io/bitnamicharts"
      + reset_values               = false
      + reuse_values               = false
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + values                     = [
          + <<-EOT
                namespace: sealed-secrets
                keyrenewperiod: 8766h # ~ 1 year
                
                resources:
                  limits:
                    cpu: 100m
                    memory: 64Mi
                  requests:
                    cpu: 10m
                    memory: 32Mi
            EOT,
        ]
      + verify                     = false
      + version                    = "2.18.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.sealed-secrets.kubernetes_namespace_v1.sealed-secrets will be created
  + resource "kubernetes_namespace_v1" "sealed-secrets" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "sealed-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.sealed-secrets.kubernetes_secret.sealed-secrets-key will be created
  + resource "kubernetes_secret" "sealed-secrets-key" {
      + binary_data_wo                 = (write-only attribute)
      + data                           = (sensitive value)
      + data_wo                        = (write-only attribute)
      + id                             = (known after apply)
      + type                           = "kubernetes.io/tls"
      + wait_for_service_account_token = true

      + metadata {
          + annotations      = {
              + "sealedsecrets.bitnami.com/sealed-secrets-key-primary" = "true"
            }
          + generation       = (known after apply)
          + labels           = {
              + "sealedsecrets.bitnami.com/sealed-secrets-key" = "active"
            }
          + name             = "sealed-secrets-bootstrap-key"
          + namespace        = "sealed-secrets"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.talos.data.talos_cluster_health.health will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "talos_cluster_health" "health" {
      + client_configuration = {
          + ca_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJQakNCOGFBREFnRUNBaEJKRXY5aWVSbWtTVWlwejU1aUpJOXBNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNekF5TURVd01qUmFGdzB6TlRFeE1qZ3lNRFV3TWpSYU1CQXhEakFNQmdOVgpCQW9UQlhSaGJHOXpNQ293QlFZREsyVndBeUVBbDk1YnFvTlBQTnJIYlpWOXVqVmN6REVZelBaNG5BQU1tT1JFCmVvUGF5RTZqWVRCZk1BNEdBMVVkRHdFQi93UUVBd0lDaERBZEJnTlZIU1VFRmpBVUJnZ3JCZ0VGQlFjREFRWUkKS3dZQkJRVUhBd0l3RHdZRFZSMFRBUUgvQkFVd0F3RUIvekFkQmdOVkhRNEVGZ1FVbUFhLzN0bm8rejBRQVRDKwo5NGRKUCt0cXRNZ3dCUVlESzJWd0EwRUFLeEltQTlHY05uQnJaaEUvTVhrVjAzTWJ1Zkx4ZFJrZkpUbVF0RkVyCkFhcEhPVDZ2MjV1TzllQzBjQWk0VWZvbHVyOCtnUHdWOTN4QnFPK0RvL1JQQWc9PQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
          + client_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUJLRENCMjZBREFnRUNBaEJoeHBlMkxHc0Uwc1FBVjhKZ0c3UktNQVVHQXl0bGNEQVFNUTR3REFZRFZRUUsKRXdWMFlXeHZjekFlRncweU5URXhNekF5TURVd01qUmFGdzB5TmpFeE16QXlNRFV3TWpSYU1CTXhFVEFQQmdOVgpCQW9UQ0c5ek9tRmtiV2x1TUNvd0JRWURLMlZ3QXlFQTk2c0tlb0dqbVRqck42eUh3SStSSjBUK3JOV1R2TnFpCkJKa2VjNWlKNzZLalNEQkdNQTRHQTFVZER3RUIvd1FFQXdJSGdEQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBZkJnTlZIU01FR0RBV2dCU1lCci9lMmVqN1BSQUJNTDczaDBrLzYycTB5REFGQmdNclpYQURRUUJacVNGRwpsOUt1M1g0bzVOeEdRRFNvL0EvWWsrS0lKKzkra2VjSitna3UrTzNvLzdPbk4xM2l5cWdEM0JLN081dDhGWHJICmVEMjZpQ3VZbnY3bE5pWUcKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo="
          + client_key         = (sensitive value)
        }
      + control_plane_nodes  = [
          + "192.168.1.210",
        ]
      + endpoints            = [
          + "192.168.1.210",
        ]
      + id                   = (known after apply)
      + timeouts             = {
          + read = "10m"
        }
      + worker_nodes         = [
          + "192.168.1.211",
        ]
    }

  # module.talos.talos_machine_configuration_apply.cp_config_apply["talos-cp-01"] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "cp_config_apply" {
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
      + resolved_apply_mode         = "auto"
        # (5 unchanged attributes hidden)
    }

  # module.talos.talos_machine_configuration_apply.worker_config_apply["talos-worker-01"] will be updated in-place
  ~ resource "talos_machine_configuration_apply" "worker_config_apply" {
        id                          = "machine_configuration_apply"
      ~ machine_configuration       = (sensitive value)
      ~ machine_configuration_input = (sensitive value)
      + resolved_apply_mode         = "auto"
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 2 to change, 0 to destroy.

Warning: Deprecated Resource

  with module.proxmox_csi_plugin.kubernetes_secret.proxmox-csi-plugin,
  on modules/proxmox-csi-plugin/main.tf line 40, in resource "kubernetes_secret" "proxmox-csi-plugin":
  40: resource "kubernetes_secret" "proxmox-csi-plugin" {

Deprecated; use kubernetes_secret_v1.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
*Triggered by @renovate[bot]*